app/Controllers/Tambah.php

SELECT *
FROM `tb_kategori`
WHERE `tb_kategori`.`id` = '19'
SELECT *
FROM `tb_penulis`
WHERE `tb_penulis`.`id` = '18'
SELECT *
FROM `tb_penerbit`
WHERE `tb_penerbit`.`id` = '15'
---
    public function index()
    {
        $bookModel = new BookModel();
        $kategoriModel = new KategoriModel();
        $penulisModel = new PenulisModel();
        $penerbitModel = new PenerbitModel();

        $buku = $bookModel->findAll();

        foreach ($buku as &$book) {
            $book['kategori'] = $kategoriModel->find($book['kategori_id'])['nama'];
            $book['penulis'] = $penulisModel->find($book['penulis_id'])['nama'];
            $book['penerbit'] = $penerbitModel->find($book['penerbit_id'])['nama'];