app/Models/BookModel.php

    public function getBooksWithDetails()
    {
        return $this->select('tb_buku.*, tb_penulis.nama as penulis, tb_penerbit.nama as penerbit, tb_kategori.nama as kategori')
                    ->join('tb_penulis', 'tb_buku.penulis_id = tb_penulis.id')
                    ->join('tb_penerbit', 'tb_buku.penerbit_id = tb_penerbit.id')
                    ->join('tb_kategori', 'tb_buku.kategori_id = tb_kategori.id')
                    ->findAll();
---
SELECT `tb_buku`.*, `tb_penulis`.`nama` as `penulis`, `tb_penerbit`.`nama` as `penerbit`, `tb_kategori`.`nama` as `kategori`
FROM `tb_buku`
JOIN `tb_penulis` ON `tb_buku`.`penulis_id` = `tb_penulis`.`id`
JOIN `tb_penerbit` ON `tb_buku`.`penerbit_id` = `tb_penerbit`.`id`
JOIN `tb_kategori` ON `tb_buku`.`kategori_id` = `tb_kategori`.`id`