app/Models/UserActivityModel.php

SELECT `tb_peminjaman`.*, `tb_user`.`nama` as `user_name`, `tb_user`.`email`
FROM `tb_peminjaman`
JOIN `tb_user` ON `tb_peminjaman`.`user_id` = `tb_user`.`id`
---
    public function getUserActivities()
    {
        return $this->select('tb_peminjaman.*, tb_user.nama as user_name, tb_user.email')
                    ->join('tb_user', 'tb_peminjaman.user_id = tb_user.id')
                    ->findAll();